<!DOCTYPE html>
<html>
<head>
    <title> Lab2-3 </title>
</head>
<body>

<?php
$color = "#008cf0";
$red = "red";
print "<table border=1 cellpadding=5px>\n";
for ($y = 1; $y <= 10; $y++) {
    print "<tr>\n";
    for ($x = 1; $x <= 10; $x++) {
        if ($x == 1 && $y == 1) {
            print "\t<td>\n";
            print "<p style=\"color:$red;\">+</p>";
        } elseif ($x == 1) {
            print "\t<td>";
            print "<p style=\"color:$color;\">$y</p>";
        } elseif ($y == 1) {
            print "\t<td>";
            print "<p style=\"color:$color;\">$x</p>";
        } else {
            print "\t<td>";
            print ($x * $y);
        }
        print "</td>\n";
    }
    print "</tr>\n";
}
print "</table>";

?>
</body>
</html>

<!--№ 4-->
<!--Используя вложенные циклы for в скрипте z3-2.php отобразите на экране таблицу сложения чисел-->
<!--от 1 до 10. При этом цвет цифр в верхней строке и левом столбце должен быть задан через-->
<!--$color вне циклов, а в левой верхней ячейке должен стоять знак "+" красного цвета.-->
<!-- Ширина рамки таблицы равна 1, отступ содержимого ячеек от границы равен 5.-->
<!---->
<!--+	2	3	...	10-->
<!--2	4	5	...	12-->
<!--3	5	6	...	13-->
<!--...	...	...	...	...-->
<!--10	12	13	...	20-->
<!--(Использовать листинг 7-6).-->